piconomix/px-fwlib/libs/ATmega_DFP/atdf/ATmega8.atdf
<?xml version='1.0' encoding='UTF-8'?>
<avr-tools-device-file xmlns:xalan="http://xml.apache.org/xalan" xmlns:NumHelper="NumHelper" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATmega8L-8AU" tempmin="-40" tempmax="85" speedmax="8000000" pinout="TQFPQFN32" package="TQFP32" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="ATmega8L-8PU" tempmin="-40" tempmax="85" speedmax="8000000" pinout="PDIP28" package="PDIP28" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="ATmega8L-8MU" tempmin="-40" tempmax="85" speedmax="8000000" pinout="TQFPQFN32" package="QFN32" vccmin="2.7" vccmax="5.5"/>

    <variant ordercode="ATmega8-16AU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="TQFPQFN32" package="TQFP32" vccmin="4.5" vccmax="5.5"/>
    <variant ordercode="ATmega8-16PU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="PDIP28" package="PDIP28" vccmin="4.5" vccmax="5.5"/>
    <variant ordercode="ATmega8-16MU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="TQFPQFN32" package="QFN32" vccmin="4.5" vccmax="5.5"/>

    <variant ordercode="ATmega8L-8AN" tempmin="-40" tempmax="105" speedmax="8000000" pinout="TQFPQFN32" package="TQFP32" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="ATmega8L-8PN" tempmin="-40" tempmax="105" speedmax="8000000" pinout="PDIP28" package="PDIP28" vccmin="2.7" vccmax="5.5"/>
    <variant ordercode="ATmega8L-8MN" tempmin="-40" tempmax="105" speedmax="8000000" pinout="TQFPQFN32" package="QFN32" vccmin="2.7" vccmax="5.5"/>

    <variant ordercode="ATmega8-16AN" tempmin="-40" tempmax="105" speedmax="16000000" pinout="TQFPQFN32" package="TQFP32" vccmin="4.5" vccmax="5.5"/>
    <variant ordercode="ATmega8-16PN" tempmin="-40" tempmax="105" speedmax="16000000" pinout="PDIP28" package="PDIP28" vccmin="4.5" vccmax="5.5"/>
    <variant ordercode="ATmega8-16MN" tempmin="-40" tempmax="105" speedmax="16000000" pinout="TQFPQFN32" package="QFN32" vccmin="4.5" vccmax="5.5"/>
  </variants>
  <devices>
    <device name="ATmega8" architecture="AVR8" family="megaAVR">
      <address-spaces>
        <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x2000">
          <memory-segment start="0x0000" size="0x2000" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x40"/>
          <memory-segment start="0x1f00" size="0x0100" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1" pagesize="0x40"/>
          <memory-segment start="0x1e00" size="0x0200" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2" pagesize="0x40"/>
          <memory-segment start="0x1c00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3" pagesize="0x40"/>
          <memory-segment start="0x1800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4" pagesize="0x40"/>
        </address-space>
        <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
          <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
        </address-space>
        <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0002">
          <memory-segment start="0" size="0x0002" type="fuses" rw="RW" exec="0" name="FUSES"/>
        </address-space>
        <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
        </address-space>
        <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0460">
          <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
          <memory-segment name="MAPPED_IO" start="0x0020" size="0x0040" type="io" external="false"/>
          <memory-segment name="IRAM" start="0x0060" size="0x0400" type="ram" external="false"/>
        </address-space>
        <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0200">
          <memory-segment start="0x0000" size="0x0200" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="0x04"/>
        </address-space>
        <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
        <address-space endianness="little" name="osccal" id="osccal" start="0" size="4">
          <memory-segment start="0" size="4" type="osccal" rw="R" exec="0" name="OSCCAL"/>
        </address-space>
      </address-spaces>
      <peripherals>
        <module name="AC">
          <instance name="AC" caption="Analog Comparator">
            <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
            <signals>
              <signal group="AIN" index="1" function="default" pad="PD7"/>
              <signal group="AIN" index="0" function="default" pad="PD6"/>
            </signals>
          </instance>
        </module>
        <module name="SPI">
          <instance name="SPI" caption="Serial Peripheral Interface">
            <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
            <signals>
              <signal group="SCK" function="default" pad="PB5"/>
              <signal group="MISO" function="default" pad="PB4"/>
              <signal group="MOSI" function="default" pad="PB3"/>
              <signal group="SS" function="default" pad="PB2"/>
            </signals>
          </instance>
        </module>
        <module name="EXINT">
          <instance name="EXINT" caption="External Interrupts">
            <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
            <signals>
              <signal group="INT" index="1" function="default" pad="PD3"/>
              <signal group="INT" index="0" function="default" pad="PD2"/>
            </signals>
          </instance>
        </module>
