piconomix/px-fwlib/libs/ATmega_DFP/atdf/ATmega8.atdf
        <register caption="General Interrupt Flag Register" name="GIFR" offset="0x5A" size="1">
          <bitfield caption="External Interrupt Flags" mask="0xC0" name="INTF"/>
        </register>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Interrupt Sense Control 1 Bits" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="Interrupt Sense Control 0 Bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="LOW_LEVEL_OF_INTX" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="ANY_LOGICAL_CHANGE_OF_INTX" value="0x01"/>
        <value caption="Falling Edge of INTX" name="FALLING_EDGE_OF_INTX" value="0x02"/>
        <value caption="Rising Edge of INTX" name="RISING_EDGE_OF_INTX" value="0x03"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit" name="TC8">
      <register-group caption="Timer/Counter, 8-bit" name="TC0">
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
          <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x58" size="1">
          <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
        </register>
        <register caption="Timer/Counter0 Control Register" name="TCCR0" offset="0x53" size="1">
          <bitfield caption="Clock Select0 bit 2" mask="0x04" name="CS02"/>
          <bitfield caption="Clock Select0 bit 1" mask="0x02" name="CS01"/>
          <bitfield caption="Clock Select0 bit 0" mask="0x01" name="CS00" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer Counter 0" name="TCNT0" offset="0x52" size="1" mask="0xFF"/>
      </register-group>
      <value-group name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="NO_CLOCK_SOURCE_STOPPED" value="0x00"/>
        <value caption="Running, No Prescaling" name="RUNNING_NO_PRESCALING" value="0x01"/>
        <value caption="Running, CLK/8" name="RUNNING_CLK_8" value="0x02"/>
        <value caption="Running, CLK/64" name="RUNNING_CLK_64" value="0x03"/>
        <value caption="Running, CLK/256" name="RUNNING_CLK_256" value="0x04"/>
        <value caption="Running, CLK/1024" name="RUNNING_CLK_1024" value="0x05"/>
        <value caption="Running, ExtClk Tn Falling Edge" name="RUNNING_EXTCLK_TN_FALLING_EDGE" value="0x06"/>
        <value caption="Running, ExtClk Tn Rising Edge" name="RUNNING_EXTCLK_TN_RISING_EDGE" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
          <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="TICIE1"/>
          <bitfield caption="Timer/Counter1 Output CompareA Match Interrupt Enable" mask="0x10" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Output CompareB Match Interrupt Enable" mask="0x08" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x04" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
          <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
          <bitfield caption="Output Compare Flag 1A" mask="0x10" name="OCF1A"/>
          <bitfield caption="Output Compare Flag 1B" mask="0x08" name="OCF1B"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x04" name="TOV1"/>
        </register>
        <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x4F" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
          <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
          <bitfield caption="Force Output Compare 1A" mask="0x08" name="FOC1A"/>
          <bitfield caption="Force Output Compare 1B" mask="0x04" name="FOC1B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1"/>
        </register>
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x4E" size="1">
          <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
          <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
          <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x4C" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1A" offset="0x4A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register  Bytes" name="OCR1B" offset="0x48" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x46" size="2" mask="0xFFFF"/>
      </register-group>
      <value-group name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="NO_CLOCK_SOURCE_STOPPED" value="0x00"/>
        <value caption="Running, No Prescaling" name="RUNNING_NO_PRESCALING" value="0x01"/>
        <value caption="Running, CLK/8" name="RUNNING_CLK_8" value="0x02"/>
        <value caption="Running, CLK/64" name="RUNNING_CLK_64" value="0x03"/>
        <value caption="Running, CLK/256" name="RUNNING_CLK_256" value="0x04"/>
        <value caption="Running, CLK/1024" name="RUNNING_CLK_1024" value="0x05"/>
        <value caption="Running, ExtClk Tn Falling Edge" name="RUNNING_EXTCLK_TN_FALLING_EDGE" value="0x06"/>
        <value caption="Running, ExtClk Tn Rising Edge" name="RUNNING_EXTCLK_TN_RISING_EDGE" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
      <register-group caption="Timer/Counter, 8-bit Async" name="TC2">
        <register caption="Timer/Counter Interrupt Mask register" name="TIMSK" offset="0x59" size="1">
          <bitfield caption="Timer/Counter2 Output Compare Match Interrupt Enable" mask="0x80" name="OCIE2"/>
          <bitfield caption="Timer/Counter2 Overflow Interrupt Enable" mask="0x40" name="TOIE2"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag Register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
          <bitfield caption="Output Compare Flag 2" mask="0x80" name="OCF2"/>
          <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x40" name="TOV2"/>
        </register>
