piconomix/px-fwlib/libs/ATmega_DFP/atdf/ATmega8.atdf
        <register caption="TWI Status Register" name="TWSR" offset="0x21" size="1">
          <bitfield caption="TWI Status" mask="0xF8" name="TWS" lsb="3"/>
          <bitfield caption="TWI Prescaler" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
        </register>
        <register caption="TWI Data register" name="TWDR" offset="0x23" size="1" mask="0xFF"/>
        <register caption="TWI (Slave) Address register" name="TWAR" offset="0x22" size="1">
          <bitfield caption="TWI (Slave) Address register Bits" mask="0xFE" name="TWA"/>
          <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
        </register>
      </register-group>
      <value-group name="COMM_TWI_PRESACLE">
        <value caption="1" name="1" value="0x00"/>
        <value caption="4" name="4" value="0x01"/>
        <value caption="16" name="16" value="0x02"/>
        <value caption="64" name="64" value="0x03"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x41" size="1">
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
          <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP" values="WDOG_TIMER_PRESCALE_3BITS"/>
        </register>
      </register-group>
      <value-group name="WDOG_TIMER_PRESCALE_3BITS">
        <value caption="Oscillator Cycles 16K" name="OSCILLATOR_CYCLES_16K" value="0x00"/>
        <value caption="Oscillator Cycles 32K" name="OSCILLATOR_CYCLES_32K" value="0x01"/>
        <value caption="Oscillator Cycles 64K" name="OSCILLATOR_CYCLES_64K" value="0x02"/>
        <value caption="Oscillator Cycles 128K" name="OSCILLATOR_CYCLES_128K" value="0x03"/>
        <value caption="Oscillator Cycles 256K" name="OSCILLATOR_CYCLES_256K" value="0x04"/>
        <value caption="Oscillator Cycles 512K" name="OSCILLATOR_CYCLES_512K" value="0x05"/>
        <value caption="Oscillator Cycles 1024K" name="OSCILLATOR_CYCLES_1024K" value="0x06"/>
        <value caption="Oscillator Cycles 2048K" name="OSCILLATOR_CYCLES_2048K" value="0x07"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x38" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x37" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x36" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTC">
        <register caption="Port C Data Register" name="PORTC" offset="0x35" size="1" mask="0x7F"/>
        <register caption="Port C Data Direction Register" name="DDRC" offset="0x34" size="1" mask="0x7F"/>
        <register caption="Port C Input Pins" name="PINC" offset="0x33" size="1" mask="0x7F" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTD">
        <register caption="Port D Data Register" name="PORTD" offset="0x32" size="1" mask="0xFF"/>
        <register caption="Port D Data Direction Register" name="DDRD" offset="0x31" size="1" mask="0xFF"/>
        <register caption="Port D Input Pins" name="PIND" offset="0x30" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Address Register  Bytes" name="EEAR" offset="0x3E" size="2" mask="0x01FF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x3D" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3C" size="1">
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMWE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEWE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0x07FF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Sleep Enable" mask="0x80" name="SE"/>
          <bitfield caption="Sleep Mode Select" mask="0x70" name="SM" values="CPU_SLEEP_MODE_3BITS2"/>
          <bitfield caption="Interrupt Sense Control 1 Bits" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL2"/>
          <bitfield caption="Interrupt Sense Control 0 Bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL2"/>
        </register>
        <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x51" size="1" mask="0xFF">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Store Program Memory Control Register" name="SPMCR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read-While-Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Read-While-Write Section Read Enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
        <register caption="Special Function IO Register" name="SFIOR" offset="0x50" size="1">
          <bitfield caption="ADC High Speed Mode" mask="0x10" name="ADHSM"/>
          <bitfield caption="Pull-up Disable" mask="0x04" name="PUD"/>
          <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSR10"/>
        </register>
      </register-group>
      <value-group name="CPU_SLEEP_MODE_3BITS2">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Standby" name="STDBY" value="0x06"/>
        <value caption="Reserved" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group name="INTERRUPT_SENSE_CONTROL2">
        <value caption="Low Level of INTX" name="LOW_LEVEL_OF_INTX" value="0x00"/>
        <value caption="Any Logical Change in INTX" name="ANY_LOGICAL_CHANGE_IN_INTX" value="0x01"/>
        <value caption="Falling Edge of INTX" name="FALLING_EDGE_OF_INTX" value="0x02"/>
        <value caption="Rising Edge of INTX" name="RISING_EDGE_OF_INTX" value="0x03"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="1.0 MHz" name="1_0_MHz"/>
        <value value="0x01" caption="2.0 MHz" name="2_0_MHz"/>
        <value value="0x02" caption="4.0 MHz" name="4_0_MHz"/>
        <value value="0x03" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x27" size="1">
          <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF2"/>
          <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x0F" name="MUX"/>
        </register>
        <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x26" size="1">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC  Free Running Select" mask="0x20" name="ADFR"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x24" size="2" mask="0xFFFF"/>
      </register-group>
      <value-group name="ANALOG_ADC_V_REF2">
        <value caption="AREF, Internal Vref turned off" name="AREF_INTERNAL_VREF_TURNED_OFF" value="0x00"/>
        <value caption="AVCC with external capacitor at AREF pin" name="AVCC_WITH_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x01"/>
        <value caption="Reserved" name="RESERVED" value="0x02"/>
        <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="INTERNAL_2_56V_VOLTAGE_REFERENCE_WITH_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x03"/>
      </value-group>
      <value-group name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="2" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="PDIP28" caption="PDIP28">
      <pin position="1" pad="PC6"/>
      <pin position="2" pad="PD0"/>
      <pin position="3" pad="PD1"/>
      <pin position="4" pad="PD2"/>
      <pin position="5" pad="PD3"/>
      <pin position="6" pad="PD4"/>
      <pin position="7" pad="VCC"/>
      <pin position="8" pad="GND"/>
      <pin position="9" pad="PB6"/>
      <pin position="10" pad="PB7"/>
      <pin position="11" pad="PD5"/>
      <pin position="12" pad="PD6"/>
      <pin position="13" pad="PD7"/>
      <pin position="14" pad="PB0"/>
      <pin position="15" pad="PB1"/>
      <pin position="16" pad="PB2"/>
      <pin position="17" pad="PB3"/>
      <pin position="18" pad="PB4"/>
      <pin position="19" pad="PB5"/>
      <pin position="20" pad="AVCC"/>
      <pin position="21" pad="AREF"/>
      <pin position="22" pad="GND"/>
      <pin position="23" pad="PC0"/>
      <pin position="24" pad="PC1"/>
      <pin position="25" pad="PC2"/>
      <pin position="26" pad="PC3"/>
      <pin position="27" pad="PC4"/>
      <pin position="28" pad="PC5"/>
    </pinout>
    <pinout name="TQFPQFN32" caption="TQFPQFN32">
      <pin position="1" pad="PD3"/>
      <pin position="2" pad="PD4"/>
      <pin position="3" pad="GND"/>
      <pin position="4" pad="VCC"/>
      <pin position="5" pad="GND"/>
      <pin position="6" pad="VCC"/>
      <pin position="7" pad="PB6"/>
      <pin position="8" pad="PB7"/>
      <pin position="9" pad="PD5"/>
      <pin position="10" pad="PD6"/>
      <pin position="11" pad="PD7"/>
      <pin position="12" pad="PB0"/>
      <pin position="13" pad="PB1"/>
      <pin position="14" pad="PB2"/>
      <pin position="15" pad="PB3"/>
      <pin position="16" pad="PB4"/>
      <pin position="17" pad="PB5"/>
      <pin position="18" pad="AVCC"/>
      <pin position="19" pad="ADC6"/>
      <pin position="20" pad="AREF"/>
      <pin position="21" pad="GND"/>
      <pin position="22" pad="ADC7"/>
      <pin position="23" pad="PC0"/>
      <pin position="24" pad="PC1"/>
      <pin position="25" pad="PC2"/>
      <pin position="26" pad="PC3"/>
      <pin position="27" pad="PC4"/>
      <pin position="28" pad="PC5"/>
      <pin position="29" pad="PC6"/>
      <pin position="30" pad="PD0"/>
      <pin position="31" pad="PD1"/>
      <pin position="32" pad="PD2"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
